namespace Task_05_08
{
    internal class Program
    {
        /*
        Даны два массива размером 10*10, заполненные целыми числами в диапазоне от 1 до 9 вкл.
        Создать новый массив, который будет произведением двух предыдущих
        (перемножить элементы первых двух массивов, стоящие на одинаковых позициях и записать их в результирующий массив)
        Вывести результирующий массив
        */
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
